{
  "articles": [
    {
      "id": 1,
      "title": "Implementing Transformer-Based Motion Anonymization",
      "excerpt": "A hands-on guide to adapting transformer architectures for privacy-preserving skeleton data.",
      "content": "In this post, I walk through how to modify transformer models to anonymize skeleton-based motion data without sacrificing action recognition accuracy. We’ll cover data preprocessing, model architecture tweaks, training strategies, and evaluation metrics, with code snippets in PyTorch.",
      "author": "Thomas Carr",
      "publishDate": "2025-05-10",
      "readTime": "10 min read",
      "tags": ["Privacy", "Transformers", "Computer Vision", "Machine Learning"],
      "category": "Technical",
      "featured": true,
      "image": "",
      "likes": 0,
      "comments": 0
    },
    {
      "id": 2,
      "title": "Building HIPAA-Compliant AI Platforms on AWS",
      "excerpt": "Lessons learned from architecting a cloud-native intraoperative neurophysiological monitoring platform.",
      "content": "Drawing from my experience at ACR Technologies, I outline best practices for designing and deploying HIPAA-compliant AI systems on AWS. Topics include data encryption, audit logging, disaster-recovery setups, and CI/CD automation with AWS Amplify and Elastic Beanstalk.",
      "author": "Thomas Carr",
      "publishDate": "2025-01-15",
      "readTime": "8 min read",
      "tags": ["AWS", "HIPAA", "Cloud", "Compliance"],
      "category": "Development",
      "featured": true,
      "image": "",
      "likes": 0,
      "comments": 0
    },
    {
      "id": 3,
      "title": "Best Practices for Responsible AI Research",
      "excerpt": "Guidelines for ensuring fairness and ethical considerations in AI experiments.",
      "content": "Ethical AI goes beyond biased datasets. In this article, I cover processes like stakeholder engagement, fairness metrics selection, reproducible experiment tracking with MLflow, and compliance with FedRAMP and SOC 2 standards.",
      "author": "Thomas Carr",
      "publishDate": "2024-12-05",
      "readTime": "7 min read",
      "tags": ["AI Ethics", "Fairness", "Research"],
      "category": "Opinion",
      "featured": false,
      "image": "",
      "likes": 0,
      "comments": 0
    },
    {
      "id": 4,
      "title": "Scaling React Apps with MUI and TypeScript",
      "excerpt": "Strategies for maintainable and performant front-end development in enterprise projects.",
      "content": "Based on my work at ViBot and MDcentric, I share architectural patterns, state-management choices, and performance optimizations for large-scale React apps using Material-UI and TypeScript.",
      "author": "Thomas Carr",
      "publishDate": "2024-11-20",
      "readTime": "9 min read",
      "tags": ["React", "TypeScript", "Frontend", "Performance"],
      "category": "Development",
      "featured": false,
      "image": "",
      "likes": 0,
      "comments": 0
    },
    {
      "id": 5,
      "title": "Optimizing Slurm Workflows for ML Training",
      "excerpt": "Tips for efficient job scheduling on HPC clusters with Slurm.",
      "content": "I discuss how to structure Slurm job scripts for dependency management, resource allocation, and parallel training on A100 GPUs. Examples include multi-node setups and integration with MLflow for experiment logging.",
      "author": "Thomas Carr",
      "publishDate": "2024-10-30",
      "readTime": "6 min read",
      "tags": ["HPC", "Slurm", "Machine Learning", "DevOps"],
      "category": "Technical",
      "featured": false,
      "image": "",
      "likes": 0,
      "comments": 0
    }
  ]
}
