{
    "published": [
        {
            "title": "Linkage Attack on Skeleton-based Motion Visualization",
            "authors": "Thomas Carr, Aidong Lu, Depeng Xu",
            "conference": "CIKM 2023",
            "publicationType": "Conference",
            "abstract": "Skeleton-based motion capture and visualization is an important computer vision task, especially in the virtual reality (VR) environment. It has grown increasingly popular due to the ease of gathering skeleton data and the high demand of virtual socialization. The captured skeleton data seems anonymous but can still be used to extract personal identifiable information (PII). This can lead to an unintended privacy leakage inside a VR meta-verse. We propose a novel linkage attack on skeleton-based motion visualization. It detects if a target and a reference skeleton are the same individual. The proposed model, called Linkage Attack Neural Network (LAN), is based on the principles of a Siamese Network. It incorporates deep neural networks to embed the relevant PII then uses a classifier to match the reference and target skeletons. We also employ classical and deep motion retargeting (MR) to cast the target skeleton onto a dummy skeleton such that the motion sequence is anonymized for privacy protection. Our evaluation shows that the effectiveness of LAN in the linkage attack and the effectiveness of MR in anonymization.",
            "links": ["https://dl.acm.org/doi/10.1145/3583780.3615263"],
            "status": "Published"
        },
        {
            "title": "A Review of Privacy and Utility in Skeleton-based Data in Virtual Reality Metaverses",
            "authors": "Thomas Carr, Depeng Xu, Aidong Lu",
            "conference": "IEEE MetaCom 2024",
            "publicationType": "Conference",
            "abstract": "Capturing skeleton data is an important area of computer vision, especially for use in a virtual reality (VR) setting. As new simpler pose estimation techniques are created, the popularity of skeleton-based motion data has increased. While the skeleton data appears to be anonymous, it can be exploited to discover personally identifiable information (PII). This poses a risk of unintentional privacy leakages when skeletons are publicly displayed, like in a VR environment. In this survey, we look into the privacy implications posed by the skeleton data, focusing on the privacy and utility trade-off and current privacy-preserving techniques. We also look into differing pose estimation methods that are used to extract the skeleton data from videos or sensors. Then we will look into what skeleton-data is used for, particularly the state-of-the-art action recognition techniques. Lastly, we discuss the ethical implications of the use of skeleton data, emphasizing the need for an interdisciplinary view to address those challenges. This survey aims to provide an understanding of the current landscape of skeleton data while offering insights into the potential privacy issues that this new technique leads to.",
            "links": ["https://ieeexplore.ieee.org/abstract/document/10740130"],
            "status": "Published"
        },
        {
            "title": "User Privacy in Skeleton-based Motion Data",
            "authors": "Thomas Carr, Depeng Xu",
            "conference": "IEEE Big Data 2024 - PhD Symposium",
            "publicationType": "Conference",
            "description": "Capturing skeleton data is an important area of computer vision, especially for use in a virtual reality (VR) setting. As new techniques to extract skeletons come out, the popularity of skeleton-based motion data has increased. While the skeleton data appears to be anonymous, it can be exploited to discover personally identifiable information (PII). This poses a risk of unintentional privacy leakages when skeletons are publicly displayed, like in a VR environment. We explore the privacy implications posed by the skeleton data, focusing on the privacy and utility trade-off and current privacy-preserving techniques. In this paper, we propose a new baseline attack model Linkage Attack Neural Network (LAN) that acts as a matching classifier to distinguish whether two skeleton-sequences are from the same actor. Then we propose a new defense model, the Privacy-centric Deep Motion Retargeting (PMR) model that is an adversarial/cooperatively trained motion retargeting model. Additionally, we incorporate explanation techniques to identify and mask the most privacy-sensitive joints, either by zeroing them out or adding controlled noise. Finally, we propose a transformer-based motion retargeting model designed for real-time applications, leveraging autoregressive decoding for continuous, frame-by-frame skeleton generation.",
            "status": "Published"
        },
        {
            "title": "Skeleton Privacy Preservation via Intelligent Noise and Masking Using Explanation",
            "authors": "Thomas Carr, Yaxin Zhao, Depeng Xu, Aidong Lu",
            "conference": "PAKDD 2025",
            "publicationType": "Conference",
            "description": "Skeleton-based representations are integral to modeling human motion in computer vision due to their efficiency and effectiveness. However, despite the abstraction provided by skeletal data, privacy concerns persist as sensitive personal information can still be inferred from motion patterns. In this paper, we propose a novel methodology that leverages explainable AI techniques to enhance privacy preservation in skeleton data. By computing joint importance scores using Integrated Gradients, we identify sensitive joints and apply targeted privacy-preserving transformations, such as masking and differential privacy mechanisms, to obfuscate private information while minimizing the impact on action recognition performance. Our approach effectively reduces re-identification risks while preserving the utility of the data, as demonstrated through extensive evaluations on benchmark datasets. The code for our implementation will be publicly available alongside the publication of this paper.",
            "status": "Accepted"
        },
        {
            "title": "Privacy Centric Deep Motion Retargeting for Anonymization of Skeleton-Based Data",
            "authors": "Thomas Carr, Depeng Xu, Aidong Lu",
            "conference": "ICCV 2025",
            "publicationType": "Conference",
            "abstract": "Capturing and visualizing motion using skeleton-based techniques is a key aspect of computer vision, particularly in virtual reality (VR) settings. Its popularity has surged, driven by the simplicity of obtaining skeleton data and the growing appetite for virtual interaction. Although this skeleton data appears to be non-identifiable, it can be exploited to derive personally identifiable information (PII), posing a risk of inadvertent privacy breaches. In this paper, we explore the application of motion retargeting and its ability to mitigate privacy leakages. Motion retargeting can effectively transfer the motion from an initial user onto a dummy skeleton with the purpose of hiding PII. We propose a Privacy-centric Deep Motion Retargeting model (PMR), which mitigates the PII through adversarial learning. In our evaluation, our proposed model achieves motion retargeting performance on par with the current state-of-the-art models. More importantly, it effectively prevents the attackers from identifying the initial user.",
            "links": ["https://arxiv.org/pdf/2405.05428"],
            "status": "Pending Notification"
        }
    ],
    "ongoing": [
        {
            "title": "Skeleton Motion Retargeting Through Masked Language Model Transformers",
            "authors": "Thomas Carr, Depeng Xu, Aidong Lu",
            "conference": "ICDM 2025",
            "publicationType": "Conference",
            "description": "Investigates the use of masked language model transformers for retargeting skeleton motions, aiming to improve data utility and privacy.",
            "status": "In Writing"
        },
        {
            "title": "AnonVis: A Visualization Tool for Anonymous Skeleton-Based Human Motion",
            "authors": "Albert Bastakoti, Thomas Carr, Aidong Lu, Depeng Xu",
            "conference": "ISMAR 2025 - Demo Paper",
            "publicationType": "Conference",
            "description": "Demonstrates a visualization technique for anonymized skeletons in a VR setting, providing insights into privacy-preserving techniques for virtual environments.",
            "status": "In Writing"
        }
    ]
}
